Revit 2027 API
FaceArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual FaceArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As FaceArrayIterator
public:
virtual FaceArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> FaceArrayIterator
override ReverseIterator : unit -> FaceArrayIterator
Return Value
FaceArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
FaceArray Class
Autodesk.Revit.DB Namespace